{
  "backend/main.mo": "Defines investment plans, AI insights, and lead types, initializes default data, and stores them in maps.",
  "feature_evidence.json": "Feature evidence report linking a wallet balance update requirement to the frontend WalletPage file.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, dark mode variables, and base styles.",
  "frontend/index.html": "HTML entry template setting metadata, fonts, favicon, and loading the React app.",
  "frontend/public/favicon.svg": "SVG favicon featuring a geometric red-on-black hexagonal logo with central accents.",
  "frontend/src/App.tsx": "Root component that imports global styles and renders the AppRouter.",
  "frontend/src/components/auth/InternetIdentityRegistrationDialog.tsx": "Dialog managing Internet Identity login with loading, success, and error states and automatic navigation on success.",
  "frontend/src/components/dashboard/DashboardHeader.tsx": "Dashboard header showing branding and a sign-out button that clears identity and cache.",
  "frontend/src/components/insights/AIInsightsSection.tsx": "Section fetching AI insights and displaying them with impact styling, loading skeletons, and error handling.",
  "frontend/src/components/site/AnalyticsPreviewSection.tsx": "Renders a performance analytics preview with animated metrics, sample chart data, and a disclaimer. Displays metric cards and a portfolio performance card.",
  "frontend/src/components/site/ContactSection.tsx": "Implements a contact form with validation, lead submission, and optional lead viewing. Handles input state, errors, and submission feedback.",
  "frontend/src/components/site/FaqSection.tsx": "Displays a list of FAQs in an accordion format. Each question expands to show detailed answers.",
  "frontend/src/components/site/FeaturesSection.tsx": "Shows a grid of feature cards describing AI and security capabilities. Each card includes an icon, title, description, and badge.",
  "frontend/src/components/site/HeroSection.tsx": "Renders the hero banner with background imagery, headings, CTAs, and quick stats. Includes a sign‑in trigger and smooth-scroll link.",
  "frontend/src/components/site/PricingSection.tsx": "Fetches and displays investment plans with risk badges, selection logic, related-plan filtering, and loading/error states. Allows switching between all plans and related plans.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the site footer with branding, navigation links, social icons, and a disclaimer, using smooth scroll for section navigation.",
  "frontend/src/components/site/SiteHeader.tsx": "Implements a responsive site header with navigation, mobile menu, and actions for scrolling, opening the dashboard, and triggering sign‑in.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAIInsights.ts": "Fetches AI insights from the backend actor using a react-query query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useInvestmentPlans.ts": "Retrieves investment plans from the backend actor using react-query.",
  "frontend/src/hooks/useLeads.ts": "Fetches lead entries from the backend actor, optionally enabled based on a flag.",
  "frontend/src/hooks/useLeadSubmission.ts": "Submits lead information via the backend actor and invalidates the leads query on success.",
  "frontend/src/hooks/useQueries.ts": "Handles fetching and saving the caller’s user profile through react-query mutations and queries.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode themes, utilities, and global UI effects like smooth scrolling and accessibility focus.",
  "frontend/src/main.tsx": "Bootstrap file that renders the app with React Query and Internet Identity providers.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the authenticated dashboard with a welcome message, stats grid, and quick actions, using user profile and navigation handlers.",
  "frontend/src/pages/LandingPage.tsx": "Composes the public landing page sections and passes sign‑in and dashboard navigation handlers.",
  "frontend/src/pages/WalletPage.tsx": "Displays wallet balance, actions, and transaction history, with balance determined by the user's principal and navigation controls.",
  "frontend/src/router/AppRouter.tsx": "Implements hash‑based routing between landing, dashboard, and wallet pages with protected routes and a sign‑in dialog.",
  "frontend/src/router/ProtectedDashboardRoute.tsx": "Guards dashboard routes by checking Internet Identity auth, showing loading or sign‑in prompts when needed.",
  "frontend/src/router/useHashRoute.ts": "Provides a simple hash‑based router hook with route state and a navigate function.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters across query strings and hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Defines the project state, listing existing features and pending requests for updating pricing ranges, percentage values, and a user balance display. Contains metadata about versioning, issues, and project settings."
}