{
  "backend/main.mo": "Defines data types and map stores for investment plans, AI insights, leads, deposit requests, and access control, with query and update functions for retrieval and submission.",
  "feature_evidence.json": "Describes a feature update linking specific frontend files to a button-triggered sign-in flow and dashboard navigation, with metadata for components and tests.",
  "frontend-file-summaries.txt": "Provides short summaries of various frontend components, hooks, and pages for reference in build planning.",
  "frontend/index.css": "Defines global Tailwind-based styles with custom CSS variables for a dark red/black theme.",
  "frontend/index.html": "Base HTML document loading fonts, metadata, favicon, and mounting the React app in dark mode.",
  "frontend/public/favicon.svg": "SVG favicon featuring a geometric red-accented logo inside a rounded black square.",
  "frontend/src/App.tsx": "Sets up the React Query client and renders the application router.",
  "frontend/src/components/auth/InternetIdentityRegistrationDialog.tsx": "Dialog component handling Internet Identity login and user registration with success, error, and loading states.",
  "frontend/src/components/dashboard/DashboardHeader.tsx": "Dashboard header with logo, profile navigation, and a sign-out flow that clears auth and cached data.",
  "frontend/src/components/insights/AIInsightsSection.tsx": "Displays AI-generated market insights with loading, error, and styled insight cards, including impact and time-horizon color coding.",
  "frontend/src/components/profile/ProfileInlineEditField.tsx": "Reusable inline-edit field allowing validation and async save with error handling and edit/cancel controls.",
  "frontend/src/components/site/AnalyticsPreviewSection.tsx": "Shows animated mock analytics data, metrics cards, and a performance chart preview with an illustrative-data disclaimer.",
  "frontend/src/components/site/ContactSection.tsx": "Implements a contact form with validation, lead submission, and optional lead list display.",
  "frontend/src/components/site/FaqSection.tsx": "Renders a FAQ list using an accordion with predefined questions and answers.",
  "frontend/src/components/site/FeaturesSection.tsx": "Displays a grid of feature cards highlighting AI capabilities, performance, security, and analytics features.",
  "frontend/src/components/site/HeroSection.tsx": "Landing hero with background visuals, marketing text, stats, and CTA buttons for sign‑in and scrolling to insights.",
  "frontend/src/components/site/PricingSection.tsx": "Displays investment plans with loading states, risk indicators, and triggers sign‑in or an investment dialog.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer with branding, navigation links, social icons, and a disclaimer plus smooth‑scroll behavior.",
  "frontend/src/components/site/SiteHeader.tsx": "Header with logo, navigation, sign‑in/dashboard CTAs, and a mobile sheet menu.",
  "frontend/src/components/site/StartInvestFlowDialog.tsx": "Multi‑step dialog guiding users through confirming, entering, reviewing, and purchasing an investment plan.",
  "frontend/src/components/wallet/WalletTransferMethodsList.tsx": "Lists crypto wallet transfer methods and allows copying addresses with visual feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminWalletCredit.ts": "Provides admin hooks for checking admin status and mutating user wallet balances via the actor.",
  "frontend/src/hooks/useAIInsights.ts": "React Query hook that fetches AI insights from the backend actor when available.",
  "frontend/src/hooks/useDepositEligibility.ts": "Queries whether the authenticated user is eligible to make a deposit.",
  "frontend/src/hooks/useDepositSubmission.ts": "Handles authenticated file-based deposit submissions with optional upload progress.",
  "frontend/src/hooks/useEnsureRegisteredUser.ts": "Ensures the authenticated user is registered in the backend by calling registration once per session.",
  "frontend/src/hooks/useInactivityTimeout.ts": "Sets a 15‑minute inactivity timer on non-exempt routes and triggers a callback after timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and stored identities via a React provider.",
  "frontend/src/hooks/useInvestmentPlans.ts": "Fetches available investment plans from the backend actor.",
  "frontend/src/hooks/useLeads.ts": "Fetches leads from the backend when enabled and an actor is available.",
  "frontend/src/hooks/useLeadSubmission.ts": "Submits lead information to the backend and invalidates cached lead data.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for retrieving and updating the caller's user profile.",
  "frontend/src/hooks/useRegisterUserNumber.ts": "Registers a user's unique number and invalidates related eligibility queries.",
  "frontend/src/hooks/useUniqueNumber.ts": "Fetches the caller's assigned unique number, returning null if unavailable.",
  "frontend/src/hooks/useWallet.ts": "Provides wallet balance and weekly return queries plus mutations for purchases and wallet initialization.",
  "frontend/src/index.css": "Defines tailwind base styles, theme variables, dark mode values, and utility classes including accessibility and visual effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminWalletCreditPage.tsx": "Admin interface for crediting or setting wallet balances by principal or email with validation and mutation hooks.",
  "frontend/src/pages/DashboardPage.tsx": "Displays user dashboard with profile greeting, wallet stats, weekly returns, and admin access check.",
  "frontend/src/pages/InvestmentPlansPage.tsx": "Shows investment plan pricing and navigation using site header, footer, and pricing section components.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero, features, AI insights, plans CTA, FAQ, and contact sections.",
  "frontend/src/pages/MyProfilePage.tsx": "Profile page allowing viewing and inline editing of user info with validation and save mutations.",
  "frontend/src/pages/WalletPage.tsx": "Wallet management page handling balance display, deposit workflow, registration steps, and file upload for deposit proofs.",
  "frontend/src/router/AppRouter.tsx": "Main hash-based router handling navigation, protected routes, sign‑in flow, and post-login intent redirection.",
  "frontend/src/router/ProtectedDashboardRoute.tsx": "Wrapper that checks authentication and registration state before rendering protected pages or showing a sign‑in prompt.",
  "frontend/src/router/useHashRoute.ts": "Custom hook providing simple hash-based routing with route parsing and navigation helpers.",
  "frontend/src/utils/availableBalance.ts": "Utility for formatting numeric balances as USD strings.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters across regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing current state, features, requests, and architectural notes."
}