{
  "backend/main.mo": "Defines types and maps for investment plans, AI insights, and leads, loads default data, and provides comparison utilities.",
  "feature_evidence.json": "Feature evidence report describing a wallet-route feature with related files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files describing routing, components, hooks, and UI behavior.",
  "frontend/index.css": "Tailwind base styles defining dark-theme CSS variables and global styling rules.",
  "frontend/index.html": "HTML entry file setting metadata, fonts, favicon, and mounting the React app in dark mode.",
  "frontend/public/favicon.svg": "SVG favicon containing a geometric dark-themed logo with red accents.",
  "frontend/src/App.tsx": "Root React component that imports global styles and renders the AppRouter.",
  "frontend/src/components/auth/InternetIdentityRegistrationDialog.tsx": "Dialog handling Internet Identity login flow with success, loading, and error states and redirects on success.",
  "frontend/src/components/dashboard/DashboardHeader.tsx": "Dashboard header showing branding and a sign‑out button that clears identity and navigation state.",
  "frontend/src/components/insights/AIInsightsSection.tsx": "Section that fetches and displays AI insights with loading, error, and styled insight cards.",
  "frontend/src/components/site/AnalyticsPreviewSection.tsx": "Displays animated portfolio metrics and a sample performance chart with disclaimer messaging.",
  "frontend/src/components/site/ContactSection.tsx": "Renders a contact form with validation and lead submission plus optional lead list viewing.",
  "frontend/src/components/site/FaqSection.tsx": "Shows a collapsible FAQ list detailing platform functionality, security, and investment details.",
  "frontend/src/components/site/FeaturesSection.tsx": "Presents a grid of AI and security-related feature cards with icons and descriptions.",
  "frontend/src/components/site/HeroSection.tsx": "Provides the landing hero with background visuals, headline, CTAs, and stats.",
  "frontend/src/components/site/PricingSection.tsx": "Fetches and displays investment plans with loading, error states, and risk-based styling.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the site footer with branding, social links, quick links, legal links, and a disclaimer, including smooth-scroll navigation.",
  "frontend/src/components/site/SiteHeader.tsx": "Implements the site header with desktop/mobile navigation, smooth-scroll links, and buttons for dashboard navigation and sign-in.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAIInsights.ts": "Fetches AI insights from the backend actor using react-query when the actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling identity loading, login, logout, and related state via AuthClient.",
  "frontend/src/hooks/useInvestmentPlans.ts": "Loads investment plans from the backend actor with react-query when the actor is available.",
  "frontend/src/hooks/useLeads.ts": "Fetches lead entries from the backend actor when enabled and the actor is ready.",
  "frontend/src/hooks/useLeadSubmission.ts": "Provides a mutation for submitting lead data and invalidates the leads query on success.",
  "frontend/src/hooks/useQueries.ts": "Handles querying and saving the caller’s user profile via the backend actor with react-query.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, and utility classes for accessibility and visuals.",
  "frontend/src/main.tsx": "Initializes the React app, setting up react-query and Internet Identity providers before rendering App.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page showing welcome text, stat cards, and quick actions, using user identity and navigation callbacks.",
  "frontend/src/pages/LandingPage.tsx": "Landing page composing marketing sections and routing callbacks for sign‑in and dashboard navigation.",
  "frontend/src/pages/WalletPage.tsx": "Wallet page displaying balance, deposit/withdraw buttons, and empty transaction history with navigation controls.",
  "frontend/src/router/AppRouter.tsx": "Hash‑based router mapping routes to pages with protected routes and sign‑in dialog handling.",
  "frontend/src/router/ProtectedDashboardRoute.tsx": "Wrapper that checks authentication state and either shows loading, prompts sign‑in, or renders protected content.",
  "frontend/src/router/useHashRoute.ts": "Custom hook implementing simple hash routing with route state and navigation helper.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, animations, plugins, and content paths.",
  "project_state.json": "Project state file tracking features, pending requests, and project metadata."
}