{
  "backend/main.mo": "Defines investment plans, AI insights, leads, and user wallet maps, initializes default plan data, and provides comparison helpers.",
  "feature_evidence.json": "Feature evidence report mapping features to involved files, components, and requirements with confidence levels.",
  "frontend-file-summaries.txt": "Provides short summaries of many frontend files describing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind-based styling defining color tokens, dark mode variables, and base layout rules.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, favicon, and mounts the React application.",
  "frontend/public/favicon.svg": "SVG favicon containing a red-accent geometric logo on a dark background.",
  "frontend/src/App.tsx": "Wraps the application router with a React Query client provider using configured defaults.",
  "frontend/src/components/auth/InternetIdentityRegistrationDialog.tsx": "Dialog handling Internet Identity login with success, error, and loading states and automatic navigation on success.",
  "frontend/src/components/dashboard/DashboardHeader.tsx": "Dashboard header showing branding, profile navigation, and sign‑out logic with loading states.",
  "frontend/src/components/insights/AIInsightsSection.tsx": "Displays AI-generated market insights with loading, error, and styled insight cards using data from useAIInsights.",
  "frontend/src/components/site/AnalyticsPreviewSection.tsx": "Shows animated portfolio metrics and a sample performance chart with a demo disclaimer.",
  "frontend/src/components/site/ContactSection.tsx": "Provides a contact form with validation, lead submission, and optional lead list display.",
  "frontend/src/components/site/FaqSection.tsx": "Renders an accordion of predefined FAQs about the AI investment platform.",
  "frontend/src/components/site/FeaturesSection.tsx": "Lists feature cards highlighting AI capabilities, security, and analytics benefits.",
  "frontend/src/components/site/HeroSection.tsx": "Displays the landing page hero with background visuals, headline, CTAs, and quick stats.",
  "frontend/src/components/site/PricingSection.tsx": "Displays investment plans with risk badges, loading states, and an invest flow trigger requiring sign‑in if unauthenticated.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders site footer with brand info, quick links, social links, and a disclaimer, including smooth scrolling navigation.",
  "frontend/src/components/site/SiteHeader.tsx": "Provides a responsive header with navigation links, sign‑in or dashboard CTA, and a mobile sheet menu.",
  "frontend/src/components/site/StartInvestFlowDialog.tsx": "Implements a multi‑step dialog for confirming, entering, reviewing, and submitting an investment purchase with balance validation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAIInsights.ts": "Fetches AI insights from the backend actor using React Query, enabled once the actor is available.",
  "frontend/src/hooks/useInactivityTimeout.ts": "Triggers a timeout callback after 15 minutes of inactivity on non‑excluded routes, resetting on common user actions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, exposing identity state, login, logout, and status helpers.",
  "frontend/src/hooks/useInvestmentPlans.ts": "Fetches investment plans from the backend actor using React Query, enabled once the actor is ready.",
  "frontend/src/hooks/useLeads.ts": "Fetches lead entries from the backend when enabled and the actor is available.",
  "frontend/src/hooks/useLeadSubmission.ts": "Defines a mutation to submit lead data via the actor and invalidates the leads query on success.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks to get and save the caller’s user profile using React Query mutations and queries.",
  "frontend/src/hooks/useUniqueNumber.ts": "Retrieves the caller’s unique number, returning null if unavailable, with loading state tied to actor readiness.",
  "frontend/src/hooks/useWallet.ts": "Contains hooks to fetch wallet balance and weekly return, and mutations for purchasing plans and initializing the wallet.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, accessibility utilities, and custom UI effects.",
  "frontend/src/main.tsx": "Sets up React rendering with QueryClientProvider and InternetIdentityProvider wrapping the App component.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the user dashboard showing profile data, wallet stats, and navigation actions using various hooks.",
  "frontend/src/pages/InvestmentPlansPage.tsx": "Displays the investment plans section with header, pricing, and footer, supporting navigation and sign-in triggers.",
  "frontend/src/pages/LandingPage.tsx": "Builds the main landing page with hero, features, AI insights, CTAs, and navigation to plans or sign‑in.",
  "frontend/src/pages/MyProfilePage.tsx": "Renders a protected profile page showing the user's name, email, principal ID, and unique number with loading and error states.",
  "frontend/src/pages/WalletPage.tsx": "Displays the user's wallet balance with loading/error handling and includes disabled deposit and withdrawal UI sections.",
  "frontend/src/router/AppRouter.tsx": "Defines hash‑based routing and navigation handlers, wiring pages with protection, sign‑in flow, and inactivity timeout.",
  "frontend/src/router/ProtectedDashboardRoute.tsx": "Guards dashboard routes by checking authentication, showing loading or sign‑in prompts when needed.",
  "frontend/src/router/useHashRoute.ts": "Implements simple hash‑based routing with route parsing and navigation helpers.",
  "frontend/src/utils/availableBalance.ts": "Provides a helper to format numeric balances as USD strings.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters for hash or query‑based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Tracks project metadata, existing features for a My Profile page, and new feature requests. Contains state such as schema version, project name, and pending requirements."
}