{
  "backend/main.mo": "Defines investment plans, AI insights, and leads with default data stored in maps and comparison helpers for sorting.",
  "feature_evidence.json": "Empty feature evidence report structure with no recorded features.",
  "frontend-file-summaries.txt": "List of summarized descriptions for all frontend components, hooks, and assets.",
  "frontend/index.css": "Global Tailwind-based CSS defining color variables, dark mode styles, and base element styling.",
  "frontend/index.html": "Main HTML entry with metadata, fonts, favicon, and root app mount point.",
  "frontend/public/favicon.svg": "SVG favicon featuring a red geometric emblem on a black rounded square.",
  "frontend/src/App.tsx": "Minimal root component that renders the LandingPage.",
  "frontend/src/components/insights/AIInsightsSection.tsx": "Fetches and displays AI insights with loading, error handling, color-coded impact indicators, and a demo disclaimer.",
  "frontend/src/components/site/AnalyticsPreviewSection.tsx": "Shows animated performance metrics, a demo disclaimer, and a six‑month chart with trend cards.",
  "frontend/src/components/site/ContactSection.tsx": "Contact form with validation, lead submission, state management, and optional admin lead viewer.",
  "frontend/src/components/site/FaqSection.tsx": "Renders a FAQ section using an accordion with predefined questions and answers about the AI investment platform.",
  "frontend/src/components/site/FeaturesSection.tsx": "Displays a grid of feature cards highlighting key AI capabilities and security aspects of the platform.",
  "frontend/src/components/site/HeroSection.tsx": "Creates the landing hero area with background visuals, headline, CTAs, and key platform stats.",
  "frontend/src/components/site/PricingSection.tsx": "Fetches and displays investment plans with loading, error, and featured plan states, including CTAs to contact.",
  "frontend/src/components/site/SiteFooter.tsx": "Provides footer content with brand info, navigation links, social icons, and a disclaimer.",
  "frontend/src/components/site/SiteHeader.tsx": "Implements a responsive header with navigation links, mobile menu, and smooth scrolling behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAIInsights.ts": "Defines a React Query hook that retrieves AI insights from the backend actor when available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, stored identities, and auth state.",
  "frontend/src/hooks/useInvestmentPlans.ts": "Fetches investment plans from the backend actor using React Query when the actor is ready.",
  "frontend/src/hooks/useLeads.ts": "Loads backend lead entries when enabled and when the actor is initialized.",
  "frontend/src/hooks/useLeadSubmission.ts": "Submits lead data through the backend actor and invalidates the leads query on success.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode settings, accessibility utilities, and custom visual effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/LandingPage.tsx": "Composes the main marketing landing page from multiple site sections and components.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, typography, and enabling plugins.",
  "project_state.json": "Project metadata describing features, issues, and state for the NexaProfit build."
}