{
  "backend/main.mo": "Defines investment plans, AI insights, and leads, initializes default data, and provides comparison helpers using Map storage.",
  "feature_evidence.json": "Feature evidence report mapping a specific pricing update requirement to affected frontend components.",
  "frontend-file-summaries.txt": "Lists short descriptions of all major frontend files and components for quick reference.",
  "frontend/index.css": "Global Tailwind-based CSS defining theme variables, dark mode values, and base styles.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, dark body class, and mounting the React app.",
  "frontend/public/favicon.svg": "SVG favicon featuring a red geometric icon on a dark rounded background.",
  "frontend/src/App.tsx": "Root React component rendering the LandingPage with global styles.",
  "frontend/src/components/insights/AIInsightsSection.tsx": "Displays AI insights from backend with loading, error, and card layout states.",
  "frontend/src/components/site/AnalyticsPreviewSection.tsx": "Shows animated portfolio analytics with metrics, charts, and illustrative-data disclaimer.",
  "frontend/src/components/site/ContactSection.tsx": "Renders a contact form with validation, lead submission, and optional lead display using related hooks.",
  "frontend/src/components/site/FaqSection.tsx": "Displays a list of predefined FAQs in an accordion layout.",
  "frontend/src/components/site/FeaturesSection.tsx": "Shows a grid of feature cards describing AI investment capabilities with icons and badges.",
  "frontend/src/components/site/HeroSection.tsx": "Presents the landing hero with background imagery, headings, stats, and scroll-triggered CTA buttons.",
  "frontend/src/components/site/PricingSection.tsx": "Loads and displays investment plans with risk indicators, loading states, errors, and CTA to contact.",
  "frontend/src/components/site/SiteFooter.tsx": "Provides footer navigation, branding, social links, and a disclaimer with smooth-scroll section links.",
  "frontend/src/components/site/SiteHeader.tsx": "Responsive site header with desktop and mobile navigation, smooth scrolling, and a gradient Get Started button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAIInsights.ts": "Fetches AI insights via the actor using a react-query hook.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading and managing identities with AuthClient.",
  "frontend/src/hooks/useInvestmentPlans.ts": "Loads investment plans from the backend actor using react-query.",
  "frontend/src/hooks/useLeads.ts": "Fetches leads from the backend actor when enabled using react-query.",
  "frontend/src/hooks/useLeadSubmission.ts": "Submits lead information via the backend actor and invalidates the leads query on success.",
  "frontend/src/index.css": "Tailwind base styles, color variables, dark mode themes, accessibility utilities, and custom effects.",
  "frontend/src/main.tsx": "Initializes the app root with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LandingPage.tsx": "Composes the landing page layout with header, multiple content sections, and footer.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, typography, animations, and plugins.",
  "project_state.json": "Tracks overall project state, including versioning, feature definitions, known issues, and notes for a NexaProfit AI-themed investment website. Highlights a frontend-backend loading bug affecting pricing plans and indicates this is a fix request."
}