{
  "backend/main.mo": "Defines investment plans, AI insights, and lead types, initializes default data, and sets up Maps for storing plans and insights.",
  "feature_evidence.json": "Lists feature evidence records mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files for documentation or reference.",
  "frontend/index.css": "Defines Tailwind base styles and dark theme CSS variables for the app’s black/red design system.",
  "frontend/index.html": "HTML entry point setting metadata, fonts, favicon, and mounting the root React app.",
  "frontend/public/favicon.svg": "SVG favicon featuring a geometric hexagon-like logo with a red center and accents.",
  "frontend/src/App.tsx": "Root component that imports global styles and renders the AppRouter.",
  "frontend/src/components/auth/InternetIdentityRegistrationDialog.tsx": "Dialog handling Internet Identity login with success, loading, and error states and optional onSuccess callback.",
  "frontend/src/components/dashboard/DashboardHeader.tsx": "Dashboard header showing brand info and a sign‑out button that clears identity and cache, then navigates to landing.",
  "frontend/src/components/insights/AIInsightsSection.tsx": "Displays AI-generated market insights with loading, error, and color-coded impact/horizon states.",
  "frontend/src/components/site/AnalyticsPreviewSection.tsx": "Shows animated performance metrics and a demo portfolio chart with disclaimers.",
  "frontend/src/components/site/ContactSection.tsx": "Implements a contact form with validation, lead submission, and optional lead list display.",
  "frontend/src/components/site/FaqSection.tsx": "Renders an FAQ accordion with preset questions and detailed answers about the platform.",
  "frontend/src/components/site/FeaturesSection.tsx": "Lists product features in cards highlighting AI, security, and analytics capabilities.",
  "frontend/src/components/site/HeroSection.tsx": "Provides a hero banner with background graphics, marketing copy, and CTA buttons for sign‑in or insights.",
  "frontend/src/components/site/PricingSection.tsx": "Displays investment plans with loading, error, and authenticated flow handling, allowing users to open an investment dialog after selecting a plan.",
  "frontend/src/components/site/SiteFooter.tsx": "Renders the site footer with navigation links, social icons, branding, and a disclaimer section.",
  "frontend/src/components/site/SiteHeader.tsx": "Provides a responsive site header with navigation, sign-in/dashboard actions, and a mobile menu using a sheet component.",
  "frontend/src/components/site/StartInvestFlowDialog.tsx": "Implements a multi-step dialog for confirming a plan, entering an amount, reviewing details, and showing success.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAIInsights.ts": "Fetches AI insights from the backend using react-query and the current actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useInvestmentPlans.ts": "Retrieves investment plans from the backend via the actor with react-query.",
  "frontend/src/hooks/useLeads.ts": "Provides a React Query hook to fetch leads using the actor, enabled only when the actor is available and not fetching.",
  "frontend/src/hooks/useLeadSubmission.ts": "Submits lead information to the backend and invalidates the leads query on success.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for retrieving and saving the caller's user profile with automatic cache invalidation.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, theme variables, dark mode settings, accessibility utilities, and visual effects.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the user dashboard with stats, quick actions, and personalized data fetched from the user profile.",
  "frontend/src/pages/InvestmentPlansPage.tsx": "Displays the investment plans page with pricing sections and navigation to dashboard or sign-in.",
  "frontend/src/pages/LandingPage.tsx": "Builds the public landing page with hero, features, AI insights, plans CTA, FAQ, and contact sections.",
  "frontend/src/pages/WalletPage.tsx": "Shows the wallet interface with balance, deposit/withdraw actions, and transaction history.",
  "frontend/src/router/AppRouter.tsx": "Implements hash-based routing and authentication-aware navigation between landing, dashboard, wallet, and plans pages.",
  "frontend/src/router/ProtectedDashboardRoute.tsx": "Guards dashboard routes by checking authentication, showing loading or sign-in prompts when needed.",
  "frontend/src/router/useHashRoute.ts": "Manages simple hash-based routing with state updates on hash changes and navigation helper.",
  "frontend/src/utils/availableBalance.ts": "Provides functions to compute a principal-based available balance with a special-case value and format it as USD.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Describes the project’s current state, including feature updates for UI values, navigation changes, and investment plan flows."
}